export const text = [

    'Имя лауреата Нобелевской премии, ' +
    'колумбийца Габриэля Гарсиа Маркеса золотыми буквами вписано в историю литературы XX века. Произведения ' +
    'писателя любят и читают во всем мире. В настоящем издании публикуется знаменитый роман-притча Гарсиа Маркеса ' +
    '«Сто лет одиночества». Соткав художественную ткань произведения из сказок, старинных преданий и легенд,' +
    ' небылиц и притч и раздвинув границы реального до границ фантастического, Гарсиа Маркес вносит собственную лепту в ' +
    'формирование «магического реализма».',

    '"Моби Дик" Германа Мелвилла (1819-1891) считается самым ' +
    'великим американским романом XIX века. В центре этого уникального, ' +
    'написанного вопреки всем законам жанра произведения, - погоня за Белым Китом. ' +
    'Захватывающий сюжет, эпические морские картины, описания ярких человеческих характеров ' +
    'в гармоничном сочетании с самыми универсальными философскими обобщениями делают' +
    ' эту книгу подлинным шедевром мировой литературы.',

    'И.С.Тургенев - имя уникальное даже в золотой плеяде классиков русской прозы XIX века. Это писатель, ' +
    'чье безупречное литературное мастерство соотносится со столь же безупречным знанием человеческой души. ' +
    'Тургенев обогатил русскую литературу самыми пленительными женскими образами и восхитительными, поэтичными ' +
    'картинами природы. Произведения Тургенева, облекающие высокую суть в изящно-простую сюжетную форму,' +
    ' по-прежнему не подвластны законам времени – и по-прежнему читаются так, словно написаны вчера… ' +
    'В романе «Отцы и дети» отразилась идеологическая борьба двух поколений, являвшаяся одной из главных ' +
    'особенностей общественной жизни 60-х годов XIX века. Роман приобрел непреходящие общечеловеческий интерес ' +
    'и значение.',

    'Говард Филлипс Лавкрафт (1890-1937), основатель литературы `сверхъестественного ужаса`, при жизни не увидел ни ' +
    'одной своей книги. В наше время его творчество собрано и изучено, отделено от многочисленных подделок и' +
    ' вошло в золотой фонд литературы XX века.Первые три книги настоящего издания Лавкрафта представляют ' +
    'собой полный свод рассказов и эссе, а четвертую и пятую составили рассказы, написанные им в соавторстве.' +
    ' `Сверхъестественный ужас` не был изобретен писателем, но `литература ужаса` без Лавкрафта немыслима.',

    '"Преступление и наказание" - роман об одном преступлении. Двойное убийство, совершенное бедным студентом ' +
    'из-за денег. Трудно найти фабулу проще, но интеллектуальное и душевное потрясение, которое производит' +
    ' роман, неизгладимо. В чем здесь загадка? Кроме простого и очевидного ответа «в гениальности ' +
    'Достоевского», возможно, существует как минимум еще один: «проклятые» вопросы не имеют простых и ' +
    'положительных ответов. Нищета, собственные страдания и страдания близких всегда ставили и будут' +
    ' ставить человека перед выбором: имею ли я право преступить любой нравственный закон, чтобы потом ' +
    'стать спасителем униженных и утешителем слабых; должен ли я сперва возлюбить себя, а только потом, став ' +
    'сильным, возлюбить ближнего своего? Это вечные вопросы.',

    'Роман "Идиот" - не только крайне известное произведение классика русской литературы Федора Достоевского,' +
    ' но и одна из его любимых работ. «Главная мысль романа — изобразить положительно прекрасного человека.' +
    'Прекрасное есть идеал, а идеал — ни наш, ни цивилизованной Европы еще далеко не выработался. На свете' +
    ' есть одно только положительно прекрасное лицо — Христос», — констатировал автор, работая над своим ярчайшим трудом.' +
    'Странный колорит лежит на этом романе; все фантастично здесь, и, вместе, как будто это фантастическое — звездный,' +
    ' мерцающий свет, падающий на серую нашу действительность из далекого, далекого будущего' +
    '  - Отечественный философ Василий Розанов.',

    '"Трудно быть богом". Наверное, самый прославленный из романов братьев Стругацких. История землянина,' +
    ' ставшего "наблюдателем" на планете, застрявшей в эпохе позднего средневековья, и принужденного "не вмешиваться" ' +
    'в происходящее, экранизирована уже несколько раз - однако даже лучший фильм не в силах передать всего таланта ' +
    'книги, на основе которой он снят!.. Книга дополнена "Комментариями", Бориса Стругацкого о том, как был ' +
    'написан роман "Трудно быть богом".',

    'hello pidor'


]


export const excludedButtons = {
    8: 'Backspace', 9: 'Tab', 13: 'Enter', 16: 'Shift',
    17: 'Control', 18: 'AltGraph', 19: 'Pause', 20: 'CapsLock',
    37: 'ArrowLeft', 38: 'ArrowUp', 39: 'ArrowRight', 40: 'ArrowDown',
    45: 'Insert', 46: 'Delete', 93: 'ContextMenu', 122: 'F11',
    123: 'F12', 144: 'NumLock'
}